<?php
// 以下配列の中身をfor文を使用して表示してください。
// 横枠は「-」、縦線は「|」で表示すること
/**
* 表示イメージ
*  _________________________
*  |_____|_c1|_c2|_c3|横合計|
*  |___r1|_10|__5|_20|___35|
*  |___r2|__7|__8|_12|___27|
*  |___r3|_25|__9|130|__164|
*  |縦合計|_42|_22|162|__226|
*  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
*/

$arr = [
 'r1' => ['c1' => 10, 'c2' => 5, 'c3' => 20],
 'r2' => ['c1' => 7, 'c2' => 8, 'c3' => 12],
 'r3' => ['c1' => 25, 'c2' => 9, 'c3' => 130]
];

$c = []; // 最終行の合計を入れる配列
$cnt = count($arr);
?>
<table>
 <thead>
 <tr>
 _____________________________
 <th>|___</th>
 <th>|__c1</th>
 <th>|__c2</th>
 <th>|__c3</th>
 <th>|横合計|</th>
 </tr>
 </thead>
 <tbody>
 <?php for ($i = 1; $i <= $cnt; $i ++): ?>
 <tr>
 <td>|__r<?php echo $i; ?></td>
 <?php $sub_total = 0; for ($j = 1; $j <= 3; $j ++): ?>
 <td><?php $n = $arr['r' . $i]['c' . $j]; echo "|__".$n; ?></td>
 <?php $c[$j] = isset($c[$j]) ? $c[$j] + $n : $n; $sub_total += $n; endfor; ?>
 <td><?php echo "|__".$sub_total."|"; ?></td>
 </tr>
 <?php endfor; ?>
 </tbody>
 <tfoot>
 <tr>
 <th>|縦合計</th>
 <?php for ($i = 1; $i <= 3; $i ++): ?>
 <th><?php echo "|_".$c[$i]; ?></th>
 <?php endfor; ?>
  <th><?php echo "|_".array_sum($c)."|"; ?></th>
 </tr>
 </tfoot>
</table>
<tr>‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾</tr>